---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn2
source: html/e35bfdc2-1d9e-b66a-18a7-11e12e5de5dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn2 Property

"Exterior Minor Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeFrontDirn2 { get; }
```